In [3]:
#importons la librairie panda

import pandas as pd

In [4]:
#importons la librairie numpy
import numpy as np

In [5]:
#importons la librairie matpotlib.pyplot
import matplotlib.pyplot as plt

In [6]:
#creons une série en laissant panda faire des indexs par défaut 
#quand is ne sont pas créés 
s = pd.Series([1,3,5,np.nan,6,8])

In [7]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [8]:
#Creeons une dataframe en passant un tableau numpy 
#avec un index de date et des colonnes
dates = pd.date_range('20130101', periods=6)

In [12]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
#creation de la dataframe
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [14]:
df

                   A         B         C         D
2013-01-01  0.125722 -1.151434 -1.535197  2.027374
2013-01-02 -1.096000  0.947312  0.679021 -0.141861
2013-01-03  0.250690  0.824599 -0.746482  1.086372
2013-01-04 -0.307181  0.483628  0.419302 -0.743691
2013-01-05  1.011520 -0.395029  1.283587 -1.076912
2013-01-06 -1.720037 -0.590839  2.253447  0.758891

In [9]:
#creation de la dataframe en y ajoutant comme paramètres un dictionnaires d'objets 
#pouvant etre convertis comme:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [17]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
#on peut vérifier les types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# viewing data

In [21]:
df.head()
#affichons df

                   A         B         C         D
2013-01-01  0.125722 -1.151434 -1.535197  2.027374
2013-01-02 -1.096000  0.947312  0.679021 -0.141861
2013-01-03  0.250690  0.824599 -0.746482  1.086372
2013-01-04 -0.307181  0.483628  0.419302 -0.743691
2013-01-05  1.011520 -0.395029  1.283587 -1.076912

In [22]:
df.tail(3)
#affichons les 3 premiers éléments de df

                   A         B         C         D
2013-01-04 -0.307181  0.483628  0.419302 -0.743691
2013-01-05  1.011520 -0.395029  1.283587 -1.076912
2013-01-06 -1.720037 -0.590839  2.253447  0.758891

In [23]:
df.index
#affichons les titres de lignes et leur type

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.columns
#affichons les titres de colonnes et leur type

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
df.values
#les valeurs de la dataframe

array([[ 0.12572208, -1.15143358, -1.53519735,  2.02737448],
       [-1.09600039,  0.94731239,  0.67902082, -0.14186095],
       [ 0.25069032,  0.82459943, -0.74648194,  1.08637207],
       [-0.30718061,  0.48362785,  0.41930183, -0.74369105],
       [ 1.01151954, -0.39502932,  1.28358707, -1.07691206],
       [-1.72003713, -0.59083944,  2.25344678,  0.75889084]])

In [28]:
df.describe()
#description des caractéristiques de la dataframe

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.289214  0.019706  0.392280  0.318362
std    0.985298  0.853214  1.367718  1.182470
min   -1.720037 -1.151434 -1.535197 -1.076912
25%   -0.898795 -0.541887 -0.455036 -0.593234
50%   -0.090729  0.044299  0.549161  0.308515
75%    0.219448  0.739357  1.132446  1.004502
max    1.011520  0.947312  2.253447  2.027374

In [29]:
#Transposons la data en tournant les colonnes t lignes
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.125722   -1.096000    0.250690   -0.307181    1.011520   -1.720037
B   -1.151434    0.947312    0.824599    0.483628   -0.395029   -0.590839
C   -1.535197    0.679021   -0.746482    0.419302    1.283587    2.253447
D    2.027374   -0.141861    1.086372   -0.743691   -1.076912    0.758891

In [30]:
#Rangement pas ordre de colonne décroissante

                   D         C         B         A
2013-01-01  2.027374 -1.535197 -1.151434  0.125722
2013-01-02 -0.141861  0.679021  0.947312 -1.096000
2013-01-03  1.086372 -0.746482  0.824599  0.250690
2013-01-04 -0.743691  0.419302  0.483628 -0.307181
2013-01-05 -1.076912  1.283587 -0.395029  1.011520
2013-01-06  0.758891  2.253447 -0.590839 -1.720037

In [31]:
#Rangement pas ordre de colonne croissante
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01  0.125722 -1.151434 -1.535197  2.027374
2013-01-02 -1.096000  0.947312  0.679021 -0.141861
2013-01-03  0.250690  0.824599 -0.746482  1.086372
2013-01-04 -0.307181  0.483628  0.419302 -0.743691
2013-01-05  1.011520 -0.395029  1.283587 -1.076912
2013-01-06 -1.720037 -0.590839  2.253447  0.758891

In [32]:
df.sort_values(by='B')
#rangement par ordre de la colonne B

                   A         B         C         D
2013-01-01  0.125722 -1.151434 -1.535197  2.027374
2013-01-06 -1.720037 -0.590839  2.253447  0.758891
2013-01-05  1.011520 -0.395029  1.283587 -1.076912
2013-01-04 -0.307181  0.483628  0.419302 -0.743691
2013-01-03  0.250690  0.824599 -0.746482  1.086372
2013-01-02 -1.096000  0.947312  0.679021 -0.141861

# getting

In [34]:
df['A']
#affichage de la colonne A

2013-01-01    0.125722
2013-01-02   -1.096000
2013-01-03    0.250690
2013-01-04   -0.307181
2013-01-05    1.011520
2013-01-06   -1.720037
Freq: D, Name: A, dtype: float64

In [35]:
df[0:3]
#les 3 premieres lignes

                   A         B         C         D
2013-01-01  0.125722 -1.151434 -1.535197  2.027374
2013-01-02 -1.096000  0.947312  0.679021 -0.141861
2013-01-03  0.250690  0.824599 -0.746482  1.086372

In [36]:
df['20130102':'20130104']
#affichage des lignes coprises entre les valeurs

                   A         B         C         D
2013-01-02 -1.096000  0.947312  0.679021 -0.141861
2013-01-03  0.250690  0.824599 -0.746482  1.086372
2013-01-04 -0.307181  0.483628  0.419302 -0.743691

# Selection by Label

In [38]:
df.loc[dates[0]]
#affichage des valeurs à l'emplacement 0 des dates

A    0.125722
B   -1.151434
C   -1.535197
D    2.027374
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
df.loc[:,['A','B']]
#affichage des colonnes A et B et de toutes les lignes

                   A         B
2013-01-01  0.125722 -1.151434
2013-01-02 -1.096000  0.947312
2013-01-03  0.250690  0.824599
2013-01-04 -0.307181  0.483628
2013-01-05  1.011520 -0.395029
2013-01-06 -1.720037 -0.590839

In [40]:
#affichage de la sequence de date et des 2 colonnes A et B
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.096000  0.947312
2013-01-03  0.250690  0.824599
2013-01-04 -0.307181  0.483628

In [41]:
df.loc['20130102',['A','B']]
#

A   -1.096000
B    0.947312
Name: 2013-01-02 00:00:00, dtype: float64

In [42]:
#affichage de l'intersection des colonnes A et B et de la ligne de date
df.loc['20130102',['A','B']]

A   -1.096000
B    0.947312
Name: 2013-01-02 00:00:00, dtype: float64

In [43]:
df.loc[dates[0],'A']
#intersection de la colonne A et de l'emplacement 0 de date

0.12572207885430259

In [44]:
df.at[dates[0],'A']
#pareil que la précédente

0.12572207885430259

In [45]:
df.iloc[3]
#affichage de la ligne 4 à l'emplacement 3

A   -0.307181
B    0.483628
C    0.419302
D   -0.743691
Name: 2013-01-04 00:00:00, dtype: float64

In [46]:
 df.iloc[3:5,0:2]
#une dataframe prenant de l'emplacement ligne 3 à debut 5

                   A         B
2013-01-04 -0.307181  0.483628
2013-01-05  1.011520 -0.395029

In [47]:
 df.iloc[3:4,0:2]
#une dataframe prenant de l'emplacement ligne 3 à debut 4

                   A         B
2013-01-04 -0.307181  0.483628

In [48]:
df.iloc[[1,2,4],[0,2]]
#iloc selectionne les emplacements

                  A         C
2013-01-02 -1.09600  0.679021
2013-01-03  0.25069 -0.746482
2013-01-05  1.01152  1.283587

In [49]:
df.iloc[1:3,:]
#prend les lignes aux emplacements 1 à 2 et toutes les colonnes

                  A         B         C         D
2013-01-02 -1.09600  0.947312  0.679021 -0.141861
2013-01-03  0.25069  0.824599 -0.746482  1.086372

In [50]:
df.iloc[:,1:3]
#prend les colonnes aux emplacements 1 à 2 et toutes les lignes

                   B         C
2013-01-01 -1.151434 -1.535197
2013-01-02  0.947312  0.679021
2013-01-03  0.824599 -0.746482
2013-01-04  0.483628  0.419302
2013-01-05 -0.395029  1.283587
2013-01-06 -0.590839  2.253447

In [51]:
df.iloc[1,1]
#on obtient une valeur

0.94731239065933837

In [52]:
df[df.A > 0]
#filtrage pour les éléments

                   A         B         C         D
2013-01-01  0.125722 -1.151434 -1.535197  2.027374
2013-01-03  0.250690  0.824599 -0.746482  1.086372
2013-01-05  1.011520 -0.395029  1.283587 -1.076912

In [53]:
#les elements positifs
df[df > 0]

                   A         B         C         D
2013-01-01  0.125722       NaN       NaN  2.027374
2013-01-02       NaN  0.947312  0.679021       NaN
2013-01-03  0.250690  0.824599       NaN  1.086372
2013-01-04       NaN  0.483628  0.419302       NaN
2013-01-05  1.011520       NaN  1.283587       NaN
2013-01-06       NaN       NaN  2.253447  0.758891

In [54]:
df2 = df.copy()
#copy de la df dans  la df2

In [55]:
df2['E'] = ['one', 'one','two','three','four','three']
df2
#modification de la la colonne 2

                   A         B         C         D      E
2013-01-01  0.125722 -1.151434 -1.535197  2.027374    one
2013-01-02 -1.096000  0.947312  0.679021 -0.141861    one
2013-01-03  0.250690  0.824599 -0.746482  1.086372    two
2013-01-04 -0.307181  0.483628  0.419302 -0.743691  three
2013-01-05  1.011520 -0.395029  1.283587 -1.076912   four
2013-01-06 -1.720037 -0.590839  2.253447  0.758891  three

In [56]:
df2[df2['E'].isin(['two','four'])]
#partie de la dataframe avec two et four

                  A         B         C         D     E
2013-01-03  0.25069  0.824599 -0.746482  1.086372   two
2013-01-05  1.01152 -0.395029  1.283587 -1.076912  four

# setting

In [59]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
#on créée des séries
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [60]:
df['F'] = s1
#

In [61]:
df

                   A         B         C         D    F
2013-01-01  0.125722 -1.151434 -1.535197  2.027374  NaN
2013-01-02 -1.096000  0.947312  0.679021 -0.141861  1.0
2013-01-03  0.250690  0.824599 -0.746482  1.086372  2.0
2013-01-04 -0.307181  0.483628  0.419302 -0.743691  3.0
2013-01-05  1.011520 -0.395029  1.283587 -1.076912  4.0
2013-01-06 -1.720037 -0.590839  2.253447  0.758891  5.0

In [63]:
df.at[dates[0],'A'] = 0
#affectation de la valeur 0

In [65]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.151434 -1.535197  2.027374  NaN
2013-01-02 -1.096000  0.947312  0.679021 -0.141861  1.0
2013-01-03  0.250690  0.824599 -0.746482  1.086372  2.0
2013-01-04 -0.307181  0.483628  0.419302 -0.743691  3.0
2013-01-05  1.011520 -0.395029  1.283587 -1.076912  4.0
2013-01-06 -1.720037 -0.590839  2.253447  0.758891  5.0

In [66]:
df.iat[0,1] = 0
#affectation de la valeur 0 à la ligne 0 et col 1

In [67]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.535197  2.027374  NaN
2013-01-02 -1.096000  0.947312  0.679021 -0.141861  1.0
2013-01-03  0.250690  0.824599 -0.746482  1.086372  2.0
2013-01-04 -0.307181  0.483628  0.419302 -0.743691  3.0
2013-01-05  1.011520 -0.395029  1.283587 -1.076912  4.0
2013-01-06 -1.720037 -0.590839  2.253447  0.758891  5.0

In [68]:
df.loc[:,'D'] = np.array([5] * len(df))
#on mets un numpy array dans la colonne D

In [69]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.535197  5  NaN
2013-01-02 -1.096000  0.947312  0.679021  5  1.0
2013-01-03  0.250690  0.824599 -0.746482  5  2.0
2013-01-04 -0.307181  0.483628  0.419302  5  3.0
2013-01-05  1.011520 -0.395029  1.283587  5  4.0
2013-01-06 -1.720037 -0.590839  2.253447  5  5.0

In [71]:
df2 = df.copy()
#pour une copie de dataframe
df2[df2 > 0] = -df2
df2
#condition

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.535197 -5  NaN
2013-01-02 -1.096000 -0.947312 -0.679021 -5 -1.0
2013-01-03 -0.250690 -0.824599 -0.746482 -5 -2.0
2013-01-04 -0.307181 -0.483628 -0.419302 -5 -3.0
2013-01-05 -1.011520 -0.395029 -1.283587 -5 -4.0
2013-01-06 -1.720037 -0.590839 -2.253447 -5 -5.0

In [72]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
#reecrire la dataframe
df1.loc[dates[0]:dates[1],'E'] = 1
#assigner les valeurs a 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.535197  5  NaN  1.0
2013-01-02 -1.096000  0.947312  0.679021  5  1.0  1.0
2013-01-03  0.250690  0.824599 -0.746482  5  2.0  NaN
2013-01-04 -0.307181  0.483628  0.419302  5  3.0  NaN

In [73]:
df1.dropna(how='any')
#supprimer les lignes en na

                A         B         C  D    F    E
2013-01-02 -1.096  0.947312  0.679021  5  1.0  1.0

In [74]:
df1.fillna(value=5)
#assigner les valeurs na a 5

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.535197  5  5.0  1.0
2013-01-02 -1.096000  0.947312  0.679021  5  1.0  1.0
2013-01-03  0.250690  0.824599 -0.746482  5  2.0  5.0
2013-01-04 -0.307181  0.483628  0.419302  5  3.0  5.0

In [75]:
pd.isnull(df1)
#pour tester les valeurs booléenes

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# stats

In [76]:
df.mean()
#les opérations sont sans les na
#ici on a la moyenne par colonne

A   -0.310168
B    0.211612
C    0.392280
D    5.000000
F    3.000000
dtype: float64

In [77]:
df.mean(1)
#moyenne de la premiere colonnne

2013-01-01    0.866201
2013-01-02    1.306067
2013-01-03    1.465762
2013-01-04    1.719150
2013-01-05    2.180015
2013-01-06    1.988514
Freq: D, dtype: float64

In [86]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s
#le paramètre shift rajoute les NA

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [87]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.749310 -0.175401 -1.746482  4.0  1.0
2013-01-04 -3.307181 -2.516372 -2.580698  2.0  0.0
2013-01-05 -3.988480 -5.395029 -3.716413  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [88]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.535197  5  NaN
2013-01-02 -1.096000  0.947312  0.679021  5  1.0
2013-01-03  0.250690  0.824599 -0.746482  5  2.0
2013-01-04 -0.307181  0.483628  0.419302  5  3.0
2013-01-05  1.011520 -0.395029  1.283587  5  4.0
2013-01-06 -1.720037 -0.590839  2.253447  5  5.0

In [89]:
df.apply(np.cumsum)
#functions

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.535197   5   NaN
2013-01-02 -1.096000  0.947312 -0.856177  10   1.0
2013-01-03 -0.845310  1.771912 -1.602658  15   3.0
2013-01-04 -1.152491  2.255540 -1.183357  20   6.0
2013-01-05 -0.140971  1.860510  0.100230  25  10.0
2013-01-06 -1.861008  1.269671  2.353677  30  15.0

In [90]:
df.apply(lambda x: x.max() - x.min())
#lambda

A    2.731557
B    1.538152
C    3.788644
D    0.000000
F    4.000000
dtype: float64

In [91]:
s = pd.Series(np.random.randint(0, 7, size=10))
s
#serie

0    1
1    0
2    4
3    0
4    1
5    5
6    5
7    2
8    6
9    4
dtype: int32

In [92]:
s.value_counts()
#compter les valeurs

5    2
4    2
1    2
0    2
6    1
2    1
dtype: int64

# string

In [94]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [95]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

# merge

In [98]:
In [73]: df = pd.DataFrame(np.random.randn(10, 4))

#une dataframe auto complétée

df

          0         1         2         3
0 -0.488797 -0.927379  0.039489  0.220802
1  0.994883 -0.059405 -1.516204  0.598691
2  0.858487 -0.449776  0.772863  2.186380
3 -0.946388 -0.028667  0.228908 -0.551180
4  0.600982 -3.191818 -0.300737 -0.469828
5  0.909022  0.161361  0.977869  1.689293
6  0.734000  0.745918 -0.392771  2.008408
7  1.045298  0.057657 -0.291780  1.186517
8  1.803486  0.475023  0.566679 -0.217840
9  0.212020  1.261395 -0.721179  0.323708

In [100]:
pieces = [df[:3], df[3:7], df[7:]]
#decoupe la dataframe en pieces
pieces

[          0         1         2         3
 0 -0.488797 -0.927379  0.039489  0.220802
 1  0.994883 -0.059405 -1.516204  0.598691
 2  0.858487 -0.449776  0.772863  2.186380,
           0         1         2         3
 3 -0.946388 -0.028667  0.228908 -0.551180
 4  0.600982 -3.191818 -0.300737 -0.469828
 5  0.909022  0.161361  0.977869  1.689293
 6  0.734000  0.745918 -0.392771  2.008408,
           0         1         2         3
 7  1.045298  0.057657 -0.291780  1.186517
 8  1.803486  0.475023  0.566679 -0.217840
 9  0.212020  1.261395 -0.721179  0.323708]

In [101]:
pd.concat(pieces)
#pour fusionner les pieces en dataframe

          0         1         2         3
0 -0.488797 -0.927379  0.039489  0.220802
1  0.994883 -0.059405 -1.516204  0.598691
2  0.858487 -0.449776  0.772863  2.186380
3 -0.946388 -0.028667  0.228908 -0.551180
4  0.600982 -3.191818 -0.300737 -0.469828
5  0.909022  0.161361  0.977869  1.689293
6  0.734000  0.745918 -0.392771  2.008408
7  1.045298  0.057657 -0.291780  1.186517
8  1.803486  0.475023  0.566679 -0.217840
9  0.212020  1.261395 -0.721179  0.323708

# Join

In [103]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [105]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [106]:
pd.merge(left, right, on='key')
#on fusionne les 2 cotés

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

# Append

In [107]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.627925 -0.605065 -1.730644 -0.528975
1  0.115212 -0.763542 -0.973200  1.849503
2 -0.034925 -0.686733 -0.416405  1.235423
3 -0.389316 -0.014247  0.108971 -0.911276
4  0.246052  0.645756  0.440345  1.160235
5  0.210494 -0.917498  0.049820  2.227743
6 -0.627997  1.576202  0.250972  1.431235
7 -0.700956 -1.103685 -0.308988 -0.276534

In [108]:
s = df.iloc[3]
#la 3eme ligne
s

A   -0.389316
B   -0.014247
C    0.108971
D   -0.911276
Name: 3, dtype: float64

In [111]:
df.append(s, ignore_index=True)
#ajouter la ligne s a la fin

          A         B         C         D
0 -0.627925 -0.605065 -1.730644 -0.528975
1  0.115212 -0.763542 -0.973200  1.849503
2 -0.034925 -0.686733 -0.416405  1.235423
3 -0.389316 -0.014247  0.108971 -0.911276
4  0.246052  0.645756  0.440345  1.160235
5  0.210494 -0.917498  0.049820  2.227743
6 -0.627997  1.576202  0.250972  1.431235
7 -0.700956 -1.103685 -0.308988 -0.276534
8 -0.389316 -0.014247  0.108971 -0.911276

In [114]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                     'foo', 'bar', 'foo', 'foo'],
                  'B' : ['one', 'one', 'two', 'three',
                   'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

In [115]:
df

     A      B         C         D
0  foo    one  1.631860 -1.100716
1  bar    one  0.300011  0.001794
2  foo    two -0.013725  1.889586
3  bar  three  0.362939  0.216003
4  foo    two -0.292402 -0.174527
5  bar    two -0.780792 -1.554256
6  foo    one  0.005356 -0.259063
7  foo  three -0.118411  2.527810

In [116]:
df.groupby('A').sum()
#groupons la colonne A

            C         D
A
bar -0.117843 -1.336459
foo  1.212678  2.883091

In [117]:
#groupons les colonnes A et B
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.300011  0.001794
    three  0.362939  0.216003
    two   -0.780792 -1.554256
foo one    1.637216 -1.359778
    three -0.118411  2.527810
    two   -0.306127  1.715059

# Reshaping

In [121]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                       ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [123]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [125]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -1.280956  1.730665
      two     0.832896 -0.709013
baz   one    -0.865073  1.755161
      two     0.802197 -1.274124
foo   one     0.890444 -1.026178
      two    -2.121379  0.210509
qux   one    -2.536561  0.323591
      two    -2.955549 -0.344475

In [126]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.280956  1.730665
      two     0.832896 -0.709013
baz   one    -0.865073  1.755161
      two     0.802197 -1.274124

In [129]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.280956
               B    1.730665
       two     A    0.832896
               B   -0.709013
baz    one     A   -0.865073
               B    1.755161
       two     A    0.802197
               B   -1.274124
dtype: float64

In [130]:
stacked.unstack()

                     A         B
first second
bar   one    -1.280956  1.730665
      two     0.832896 -0.709013
baz   one    -0.865073  1.755161
      two     0.802197 -1.274124

In [131]:
stacked.unstack(1)

second        one       two
first
bar   A -1.280956  0.832896
      B  1.730665 -0.709013
baz   A -0.865073  0.802197
      B  1.755161 -1.274124

In [132]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.280956 -0.865073
       B  1.730665  1.755161
two    A  0.832896  0.802197
       B -0.709013 -1.274124

# pivot tables

In [135]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                  'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.276375 -1.235005
1     one  B  foo  0.660024  0.623805
2     two  C  foo -0.044698 -0.111140
3   three  A  bar -0.385640  0.160891
4     one  B  bar  1.548808 -1.319890
5     one  C  bar -1.410177  1.909707
6     two  A  foo -0.385343  2.185137
7   three  B  foo  0.260345 -0.974209
8     one  C  foo  0.935501 -0.780567
9     one  A  bar  1.472018  1.375457
10    two  B  bar -1.139430  0.620174
11  three  C  bar  2.264004  0.840874

In [136]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.472018  0.276375
      B  1.548808  0.660024
      C -1.410177  0.935501
three A -0.385640       NaN
      B       NaN  0.260345
      C  2.264004       NaN
two   A       NaN -0.385343
      B -1.139430       NaN
      C       NaN -0.044698